package org.example.Tasks.Arrays;

import java.util.Arrays;

//Напишите программу, которая выводит на консоль простые числа в промежутке от [2, 100].
//Используйте для решения этой задачи оператор "%" (остаток от деления) и циклы.
public class Third {
    public static void main(String[] args) {
        for (int i = 2; i <= 100; i++) { // начинаем с 2 и идем до 100
            boolean isPrime = true;

            // Вместо проверки всех чисел до i-1, оптимизируем алгоритм, проверяя делители только до квадратного корня числа.
            // Если число не делится на числа до его квадратного корня, оно не будет делиться и на числа, большие квадратного корня.
            for (int j = 2; j <= Math.sqrt(i); j++) { // проверка до корня числа
                if (i % j == 0) {
                    isPrime = false;
                    break;
                }
            }

            if (isPrime) {
                System.out.println(i); // выводим простое число
            }
        }
    }
}
