package org.example.Tasks.OOP.Seventh;
//Напишите класс, конструктор которого принимает два массива: массив значений и массив весов значений.
//Класс должен содержать метод, который будет возвращать элемент из первого массива случайным образом, с учётом его веса.
//Решение основывается на геометрической идее:
//    Будем считать, что веса — это длины некоторых отрезков.
//    Тогда надо "уложить" все отрезки в один общий,
//    генерировать случайное значение из этого общего отрезка,
//    определять в какой из наших отрезков попало значение
public class Main {
}
