package org.example.Tasks.Cycles.Figures;

import java.util.Scanner;

//Нужно нарисовать пустой квадрат с крестиком используя циклы
public class Eight {
    public static void main(String[] args) {

//        TODO:
//        Размер квадрата: Прежде всего, необходимо определить размер квадрата (например, N x N).
//        Он может быть задан как входное значение, или как фиксированное число.
//
//        Границы квадрата: Внешние границы квадрата должны быть заполнены символом (например, *).
//        Это означает, что в строках с номерами 1 и N, а также в столбцах с номерами 1 и N будут стоять *.
//
//        Крестик: Крестик будет пересекать квадрат по двум диагоналям.
//        Диагональ сверху слева в низ вправо будет обозначаться символом * на позиции, где индекс строки равен индексу столбца.
//        Диагональ сверху справа в низ влево будет иметь символ * на позиции, где индекс строки равен разнице между размером квадрата и индексом столбца.
//
//        Заполнение внутренней области:
//        Внутри квадрата (все позиции, которые не лежат на границах или на диагоналях) будут пустыми.

        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите желаемый размер стороны квадрата: ");
        int size = scanner.nextInt();

        for (int i = 0; i < size; i++) { //перебирает строки квадрата
            for (int j = 0; j < size; j++) { //перебирает столбцы квадрата.
                // Условия для рисования границ квадрата и крестика
                if (i == 0 || i == size - 1 || j == 0 || j == size - 1 || i == j || i + j == size - 1) {
                    System.out.print("*");
                } else {
                    System.out.print(" ");
                }
            }
            System.out.println(); // Переход на новую строку после завершения одной строки квадрата
        }
    }
}
